<?xml version="1.0" ?>
<!--
-- Copyright (C) 2021 Intel Corporation
-- SPDX-License-Identifier: Apache-2.0
--
  -->
<net name="shp-fseg-60" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,1,128,128,128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv3d_1/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="16,1,3,3,3" size="1728"/>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv3d_1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1,1" output_padding="0,0,0" pads_begin="1,1,1" pads_end="1,1,1" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="conv3d_1/Reshape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="1728" shape="1,16,1,1,1" size="64"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv3d_1/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv3d_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv3d_2/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="1792" shape="16,16,3,3,3" size="27648"/>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="conv3d_2/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1,1" output_padding="0,0,0" pads_begin="1,1,1" pads_end="1,1,1" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv3d_2/Reshape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="29440" shape="1,16,1,1,1" size="64"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="conv3d_2/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv3d_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="max_pooling3d_1/MaxPool3D" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2,2,2" pads_begin="0,0,0" pads_end="0,0,0" strides="2,2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv3d_3/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="29504" shape="32,16,3,3,3" size="55296"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="conv3d_3/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1,1" output_padding="0,0,0" pads_begin="1,1,1" pads_end="1,1,1" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="conv3d_3/Reshape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="84800" shape="1,32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv3d_3/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv3d_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="conv3d_4/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="84928" shape="32,32,3,3,3" size="110592"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv3d_4/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1,1" output_padding="0,0,0" pads_begin="1,1,1" pads_end="1,1,1" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="conv3d_4/Reshape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="195520" shape="1,32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv3d_4/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="conv3d_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="max_pooling3d_2/MaxPool3D" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2,2,2" pads_begin="0,0,0" pads_end="0,0,0" strides="2,2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="conv3d_5/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="195648" shape="64,32,3,3,3" size="221184"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="conv3d_5/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1,1" output_padding="0,0,0" pads_begin="1,1,1" pads_end="1,1,1" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv3d_5/Reshape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="416832" shape="1,64,1,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv3d_5/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv3d_5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="conv3d_6/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="417088" shape="64,64,3,3,3" size="442368"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv3d_6/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1,1" output_padding="0,0,0" pads_begin="1,1,1" pads_end="1,1,1" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="conv3d_6/Reshape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="859456" shape="1,64,1,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="conv3d_6/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="conv3d_6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="max_pooling3d_3/MaxPool3D" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2,2,2" pads_begin="0,0,0" pads_end="0,0,0" strides="2,2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="conv3d_7/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="859712" shape="128,64,3,3,3" size="884736"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv3d_7/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1,1" output_padding="0,0,0" pads_begin="1,1,1" pads_end="1,1,1" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv3d_7/Reshape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="1744448" shape="1,128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="conv3d_7/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="conv3d_7/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="conv3d_8/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="1744960" shape="128,128,3,3,3" size="1769472"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="conv3d_8/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1,1" output_padding="0,0,0" pads_begin="1,1,1" pads_end="1,1,1" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="conv3d_8/Reshape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="3514432" shape="1,128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="conv3d_8/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="conv3d_8/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="up_sampling3d_1/ExpandDims/Shape_" type="ShapeOf" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="5468" type="Convert" version="opset1">
			<data destination_type="i32"/>
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="up_sampling3d_1/ExpandDims/Shape_/GatherNCHWtoNHWC/Cast_15091_const" type="Const" version="opset1">
			<data element_type="i32" offset="3514944" shape="5" size="20"/>
			<output>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="up_sampling3d_1/ExpandDims/Shape_/GatherNCHWtoNHWC/Cast_25093_const" type="Const" version="opset1">
			<data element_type="i64" offset="3514964" shape="" size="8"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="48" name="up_sampling3d_1/ExpandDims/Shape_/GatherNCHWtoNHWC" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="up_sampling3d_1/ExpandDims/StridedSlice_/Cast_15115_const" type="Const" version="opset1">
			<data element_type="i64" offset="3514972" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="up_sampling3d_1/ExpandDims/StridedSlice_/Cast_25117_const" type="Const" version="opset1">
			<data element_type="i64" offset="3514980" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="up_sampling3d_1/ExpandDims/StridedSlice_" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="up_sampling3d_1/ExpandDims/scales_1037_const" type="Const" version="opset1">
			<data element_type="i32" offset="3514988" shape="1" size="4"/>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="up_sampling3d_1/ExpandDims/Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="up_sampling3d_1/ExpandDims/Interpolate_/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="up_sampling3d_1/ExpandDims/Interpolate_" type="Interpolate" version="opset1">
			<data align_corners="0" antialias="0" axes="2" mode="nearest" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="up_sampling3d_1/ExpandDims_1/Shape_" type="ShapeOf" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="5476" type="Convert" version="opset1">
			<data destination_type="i32"/>
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="up_sampling3d_1/ExpandDims_1/Shape_/GatherNCHWtoNHWC/Cast_15097_const" type="Const" version="opset1">
			<data element_type="i32" offset="3514944" shape="5" size="20"/>
			<output>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="up_sampling3d_1/ExpandDims_1/Shape_/GatherNCHWtoNHWC/Cast_25099_const" type="Const" version="opset1">
			<data element_type="i64" offset="3514964" shape="" size="8"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="60" name="up_sampling3d_1/ExpandDims_1/Shape_/GatherNCHWtoNHWC" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="up_sampling3d_1/ExpandDims_1/StridedSlice_/Cast_15081_const" type="Const" version="opset1">
			<data element_type="i64" offset="3514980" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="up_sampling3d_1/ExpandDims_1/StridedSlice_/Cast_25083_const" type="Const" version="opset1">
			<data element_type="i64" offset="3514992" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="up_sampling3d_1/ExpandDims_1/StridedSlice_" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="up_sampling3d_1/ExpandDims_1/scales_1093_const" type="Const" version="opset1">
			<data element_type="i32" offset="3514988" shape="1" size="4"/>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="up_sampling3d_1/ExpandDims_1/Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="up_sampling3d_1/ExpandDims_1/Interpolate_/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="up_sampling3d_1/ExpandDims_1/Interpolate_" type="Interpolate" version="opset1">
			<data align_corners="0" antialias="0" axes="3" mode="nearest" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="up_sampling3d_1/ExpandDims_2/Shape_" type="ShapeOf" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="5466" type="Convert" version="opset1">
			<data destination_type="i32"/>
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="up_sampling3d_1/ExpandDims_2/Shape_/GatherNCHWtoNHWC/Cast_15061_const" type="Const" version="opset1">
			<data element_type="i32" offset="3514944" shape="5" size="20"/>
			<output>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="up_sampling3d_1/ExpandDims_2/Shape_/GatherNCHWtoNHWC/Cast_25063_const" type="Const" version="opset1">
			<data element_type="i64" offset="3514964" shape="" size="8"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="72" name="up_sampling3d_1/ExpandDims_2/Shape_/GatherNCHWtoNHWC" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="up_sampling3d_1/ExpandDims_2/StridedSlice_/Cast_15107_const" type="Const" version="opset1">
			<data element_type="i64" offset="3514992" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="up_sampling3d_1/ExpandDims_2/StridedSlice_/Cast_25109_const" type="Const" version="opset1">
			<data element_type="i64" offset="3515000" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="up_sampling3d_1/ExpandDims_2/StridedSlice_" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="up_sampling3d_1/ExpandDims_2/scales_1023_const" type="Const" version="opset1">
			<data element_type="i32" offset="3514988" shape="1" size="4"/>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="up_sampling3d_1/ExpandDims_2/Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="up_sampling3d_1/ExpandDims_2/Interpolate_/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="up_sampling3d_1/ExpandDims_2/Interpolate_" type="Interpolate" version="opset1">
			<data align_corners="0" antialias="0" axes="4" mode="nearest" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="concatenate_1/concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="conv3d_9/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="3515008" shape="64,192,3,3,3" size="1327104"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="conv3d_9/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1,1" output_padding="0,0,0" pads_begin="1,1,1" pads_end="1,1,1" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="conv3d_9/Reshape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="4842112" shape="1,64,1,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="conv3d_9/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="conv3d_9/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="conv3d_10/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="4842368" shape="64,64,3,3,3" size="442368"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="conv3d_10/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1,1" output_padding="0,0,0" pads_begin="1,1,1" pads_end="1,1,1" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv3d_10/Reshape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="5284736" shape="1,64,1,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="conv3d_10/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="conv3d_10/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="up_sampling3d_2/ExpandDims/Shape_" type="ShapeOf" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="5472" type="Convert" version="opset1">
			<data destination_type="i32"/>
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="up_sampling3d_2/ExpandDims/Shape_/GatherNCHWtoNHWC/Cast_15137_const" type="Const" version="opset1">
			<data element_type="i32" offset="3514944" shape="5" size="20"/>
			<output>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="up_sampling3d_2/ExpandDims/Shape_/GatherNCHWtoNHWC/Cast_25139_const" type="Const" version="opset1">
			<data element_type="i64" offset="3514964" shape="" size="8"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="95" name="up_sampling3d_2/ExpandDims/Shape_/GatherNCHWtoNHWC" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="up_sampling3d_2/ExpandDims/StridedSlice_/Cast_15071_const" type="Const" version="opset1">
			<data element_type="i64" offset="3514972" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="up_sampling3d_2/ExpandDims/StridedSlice_/Cast_25073_const" type="Const" version="opset1">
			<data element_type="i64" offset="3514980" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="up_sampling3d_2/ExpandDims/StridedSlice_" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="up_sampling3d_2/ExpandDims/scales_1065_const" type="Const" version="opset1">
			<data element_type="i32" offset="3514988" shape="1" size="4"/>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="up_sampling3d_2/ExpandDims/Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="up_sampling3d_2/ExpandDims/Interpolate_/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="up_sampling3d_2/ExpandDims/Interpolate_" type="Interpolate" version="opset1">
			<data align_corners="0" antialias="0" axes="2" mode="nearest" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="up_sampling3d_2/ExpandDims_1/Shape_" type="ShapeOf" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="5464" type="Convert" version="opset1">
			<data destination_type="i32"/>
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="up_sampling3d_2/ExpandDims_1/Shape_/GatherNCHWtoNHWC/Cast_15057_const" type="Const" version="opset1">
			<data element_type="i32" offset="3514944" shape="5" size="20"/>
			<output>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="up_sampling3d_2/ExpandDims_1/Shape_/GatherNCHWtoNHWC/Cast_25059_const" type="Const" version="opset1">
			<data element_type="i64" offset="3514964" shape="" size="8"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="107" name="up_sampling3d_2/ExpandDims_1/Shape_/GatherNCHWtoNHWC" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="up_sampling3d_2/ExpandDims_1/StridedSlice_/Cast_15111_const" type="Const" version="opset1">
			<data element_type="i64" offset="3514980" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="up_sampling3d_2/ExpandDims_1/StridedSlice_/Cast_25113_const" type="Const" version="opset1">
			<data element_type="i64" offset="3514992" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="up_sampling3d_2/ExpandDims_1/StridedSlice_" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="up_sampling3d_2/ExpandDims_1/scales_1009_const" type="Const" version="opset1">
			<data element_type="i32" offset="3514988" shape="1" size="4"/>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="up_sampling3d_2/ExpandDims_1/Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="up_sampling3d_2/ExpandDims_1/Interpolate_/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="up_sampling3d_2/ExpandDims_1/Interpolate_" type="Interpolate" version="opset1">
			<data align_corners="0" antialias="0" axes="3" mode="nearest" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="up_sampling3d_2/ExpandDims_2/Shape_" type="ShapeOf" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="5474" type="Convert" version="opset1">
			<data destination_type="i32"/>
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="up_sampling3d_2/ExpandDims_2/Shape_/GatherNCHWtoNHWC/Cast_15101_const" type="Const" version="opset1">
			<data element_type="i32" offset="3514944" shape="5" size="20"/>
			<output>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="up_sampling3d_2/ExpandDims_2/Shape_/GatherNCHWtoNHWC/Cast_25103_const" type="Const" version="opset1">
			<data element_type="i64" offset="3514964" shape="" size="8"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="119" name="up_sampling3d_2/ExpandDims_2/Shape_/GatherNCHWtoNHWC" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="up_sampling3d_2/ExpandDims_2/StridedSlice_/Cast_15141_const" type="Const" version="opset1">
			<data element_type="i64" offset="3514992" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="up_sampling3d_2/ExpandDims_2/StridedSlice_/Cast_25143_const" type="Const" version="opset1">
			<data element_type="i64" offset="3515000" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="up_sampling3d_2/ExpandDims_2/StridedSlice_" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0">
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="up_sampling3d_2/ExpandDims_2/scales_1079_const" type="Const" version="opset1">
			<data element_type="i32" offset="3514988" shape="1" size="4"/>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="up_sampling3d_2/ExpandDims_2/Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="up_sampling3d_2/ExpandDims_2/Interpolate_/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="up_sampling3d_2/ExpandDims_2/Interpolate_" type="Interpolate" version="opset1">
			<data align_corners="0" antialias="0" axes="4" mode="nearest" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="concatenate_2/concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="conv3d_11/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="5284992" shape="32,96,3,3,3" size="331776"/>
			<output>
				<port id="1" precision="FP32">
